Repository: khulnasoft-bot/GPT-DB
Catalog: i18n/locales/*/LC_MESSAGES/gptdb_util.po
Languages: fr, ja

source: The module to scan, if not set, will scan all GPT-DB modules('gptdb,gptdb_client,gptdb_ext,gptdb_serve,gptdb_app').
fr: Le module à scanner, si non défini, scannera tous les modules GPT-DB ('gptdb,gptdb_client,gptdb_ext,gptdb_serve,gptdb_app').
ja: スキャン対象のモジュール。設定されていない場合は、すべての GPT-DB モジュール ('gptdb, gptdb_client, gptdb_ext, gptdb_serve, gptdb_app') がスキャンされます。

source: The output path, if not set, will print to packages/gptdb-serve/src/gptdb_serve/flow/compat/
fr: Le chemin de sortie, si non défini, sera imprimé dans packages/gptdb-serve/src/gptdb_serve/flow/compat/
ja: 出力パス。設定されていない場合、出力は packages/gptdb-serve/src/gptdb_serve/flow/compat/ に表示されます。

source: The current version of the flow, if not set, will read from gptdb.__version__
fr: La version actuelle du flux, si non définie, sera lue à partir de gptdb.__version__
ja: フローの現在のバージョン。設定されていない場合は、gptdb.__version__ から読み込みます。

source: The last version to compatible, if not set, will big than the current version by one minor version.
fr: La dernière version compatible, si non définie, sera supérieure à la version actuelle d'une version mineure.
ja: 互換性を持つ最後のバージョン。設定されていない場合は、現在のバージョンよりマイナーバージョンが1つ大きいバージョンになります。

source: Update the template file.
fr: Mettez à jour le fichier de modèle.
ja: テンプレートファイルを更新します。

source: Repos
fr: Dépôts
ja: リポジトリ一覧

source: Repository
fr: Dépôt
ja: リポジトリ

source: Path
fr: Chemin
ja: パス

source: gptdbs In All Repos
fr: gptdbs dans tous les dépôts
ja: すべてのリポジトリ内の gptdbs

source: Type
ja: タイプ

source: Name
fr: Nom
ja: 名前

source: Installed gptdbs
fr: GPT-DBs installés
ja: インストールされた gptdbs

source: Json Serializer
fr: Sérialiseur JSON
ja: JSON シリアライザー

source: The serializer for serializing data with json format.
fr: Le sérialiseur pour sérialiser les données au format JSON.
ja: JSON 形式でデータをシリアライズするためのシリアライザーです。

source: Hook path, it can be a class path or a function path. eg: 'gptdb.config.hooks.env_var_hook'
fr: Chemin du hook, il peut s'agir d'un chemin de classe ou d'un chemin de fonction. Par exemple : 'gptdb.config.hooks.env_var_hook'
ja: フックパスです。クラスパスまたは関数パスを指定できます。例: 'gptdb.config.hooks.env_var_hook'

source: Hook init params to pass to the hook constructor(Just for class hook), must be key-value pairs
fr: Paramètres d'initialisation du hook à passer au constructeur du hook (uniquement pour les hooks de classe), doivent être des paires clé-valeur
ja: フックコンストラクタに渡す初期化パラメータ（クラスフックの場合のみ）、キーバリューペアでなければなりません。

source: Hook params to pass to the hook, must be key-value pairs
fr: Paramètres du hook à passer au hook, doivent être des paires clé-valeur
ja: フックに渡すパラメータ、キーバリューペアでなければなりません。

source: Whether the hook is enabled, default is True
fr: Indique si le hook est activé, la valeur par défaut est True
ja: フックが有効かどうか、デフォルトは True です。

source: Logging level, just support FATAL, ERROR, WARNING, INFO, DEBUG, NOTSET
fr: Niveau de journalisation, ne prend en charge que FATAL, ERROR, WARNING, INFO, DEBUG, NOTSET
ja: ログレベル、サポートされるのは FATAL、ERROR、WARNING、INFO、DEBUG、NOTSET です。

source: The filename to store logs
fr: Le nom du fichier pour stocker les logs
ja: ログを保存するファイル名です。

source: The file to store the tracer, e.g. gptdb_webserver_tracer.jsonl
fr: Le fichier pour stocker le traceur, par exemple gptdb_webserver_tracer.jsonl
ja: トレーサーを保存するファイル、例えば gptdb_webserver_tracer.jsonl です。

source: The root operation name of the tracer
fr: Le nom de l'opération racine du traceur
ja: トレーサーのルート操作名です。

source: The exporter of the tracer, e.g. telemetry
fr: L'exportateur du traceur, par exemple la télémesure
ja: トレーサーのエクスポーター、例えばテレメトリです。

source: The endpoint of the OpenTelemetry Protocol, you can set '${env:OTEL_EXPORTER_OTLP_TRACES_ENDPOINT}' to use the environment variable
fr: Le point de terminaison du protocole OpenTelemetry. Vous pouvez définir '${env:OTEL_EXPORTER_OTLP_TRACES_ENDPOINT}' pour utiliser la variable d'environnement.
ja: OpenTelemetryプロトコルのエンドポイントです。環境変数を使用するには '${env:OTEL_EXPORTER_OTLP_TRACES_ENDPOINT}' を設定してください。

source: Whether to use insecure connection, you can set '${env:OTEL_EXPORTER_OTLP_TRACES_INSECURE}' to use the environment
fr: Indique si une connexion non sécurisée doit être utilisée. Vous pouvez définir '${env:OTEL_EXPORTER_OTLP_TRACES_INSECURE}' pour utiliser la variable d'environnement.
ja: 安全でない接続を使用するかどうかです。環境変数を使用するには '${env:OTEL_EXPORTER_OTLP_TRACES_INSECURE}' を設定してください。

source: The timeout of the connection, in seconds, you can set '${env:OTEL_EXPORTER_OTLP_TRACES_TIMEOUT}' to use the environment
fr: Le délai d'attente de la connexion, en secondes. Vous pouvez définir '${env:OTEL_EXPORTER_OTLP_TRACES_TIMEOUT}' pour utiliser la variable d'environnement.
ja: 接続のタイムアウト時間（秒単位）です。環境変数を使用するには '${env:OTEL_EXPORTER_OTLP_TRACES_TIMEOUT}' を設定してください。

source: The class of the tracer storage
fr: La classe de stockage du traceur
ja: トレーサーのストレージクラス
