Repository: khulnasoft-bot/GPT-DB
Catalog: i18n/locales/*/LC_MESSAGES/gptdb_ext_rag.po
Languages: ru

source: Chunk Parameters
ru: Параметры чанков

source: Chunk Strategy
ru: Стратегия чанкования

source: chunk strategy
ru: стратегия чанкования

source: Text Splitter
ru: Разделитель текста

source: Text splitter, if not set, will use the default text splitter.
ru: Разделитель текста. Если не задан, будет использован разделитель текста по умолчанию.

source: Splitter Type
ru: Тип разделителя

source: Splitter type
ru: тип разделителя

source: Chunk Size
ru: Размер чанка

source: Chunk size
ru: размер чанка

source: Chunk Overlap
ru: Перекрытие чанков

source: Separator
ru: Разделитель

source: Chunk separator
ru: Разделитель чанков

source: Enable Merge
ru: Включить объединение

source: Enable chunk merge by chunk_size.
ru: Включить объединение чанков по размеру чанка.

source: The API key for the embeddings API.
ru: API-ключ для API эмбеддингов.

source: The Secret key for the embeddings API. It's the sk for qianfan.
ru: Секретный ключ для API эмбеддингов. Это sk для Qianfan.

source: The real model name to pass to the provider, default is None. If backend is None, use name as the real model name.
ru: Реальное имя модели, которое нужно передать провайдеру, по умолчанию None. Если бэкенд равен None, используйте имя в качестве реального имени модели.

source: Embedding-V1 by Baidu Qianfan.
ru: Embedding-V1 от Baidu Qianfan.

source: The URL of the embeddings API.
ru: URL-адрес API эмбеддингов.

source: The embedding model are trained by BAAI, it support more than 100 working languages.
ru: Модель эмбеддингов была обучена BAAI, она поддерживает более 100 рабочих языков.

source: The name of the model to use for text embeddings.
ru: Имя модели, которую нужно использовать для текстовых эмбеддингов.

source: Jina AI Embeddings
ru: Jina AI Эмбеддинги

source: Jina AI embeddings.
ru: Jina AI эмбеддинги.

source: API Key
ru: API-ключ

source: Your API key for the Jina AI API.
ru: Ваш API-ключ для API Jina AI.

source: Model Name
ru: Название модели

source: The embedding model are trained by TongYi, it support more than 50 working languages.
ru: Модель эмбеддингов была обучена TongYi и поддерживает более 50 рабочих языков.

source: Knowledge Graph Operator
ru: Оператор знаний графа

source: Extract Documents and persist into graph database.
ru: Извлекать документы и сохранять в графовую базу данных.

source: Knowledge Graph Connector
ru: Коннектор знаний графа

source: The knowledge graph.
ru: Граф знаний.

source: Chunks
ru: Части

source: The text split chunks by chunk manager.
ru: Текст разделен на фрагменты с помощью менеджера фрагментов.

source: The assembled chunks, it has been persisted to graph store.
ru: Собранные фрагменты были сохранены в графовом хранилище.

source: Summary Operator
ru: Оператор суммаризации

source: The summary assembler operator.
ru: Оператор сборки суммаризации.

source: Knowledge
ru: Знания

source: Knowledge datasource
ru: Источник данных знаний

source: Document summary
ru: Суммаризация документа

source: LLM Client
ru: LLM 客户端

source: The LLM Client.
ru: LLM 客户端。

source: Model name
ru: Название модели

source: LLM model name
ru: Название LLM модели

source: prompt language
ru: Язык промпта

source: Max iteration with LLM
ru: Максимальное количество итераций с Large Language Model

source: Concurrency limit with LLM
ru: Ограничение параллелизма с Large Language Model

source: The concurrency limit with llm
ru: Ограничение параллелизма с Large Language Model

source: Embedding Retriever Operator
ru: Оператор извлечения эмбеддингов

source: Retrieve candidates from vector store.
ru: Извлечь кандидатов из векторного хранилища.

source: Storage Index Store
ru: Хранилище индексов хранения

source: The vector store connector.
ru: Коннектор векторного хранилища.

source: Top K
ru: Топ K

source: The number of candidates.
ru: Количество кандидатов.

source: Score Threshold
ru: Порог оценки

source: The score threshold, if score of candidate is less than it, it will be filtered.
ru: Порог оценки. Если оценка кандидата меньше этого порога, он будет отфильтрован.

source: Query Rewrite
ru: Перезапись запроса

source: The query rewrite resource.
ru: Ресурс перезаписи запроса.

source: Rerank
ru: Переранжирование

source: The rerank.
ru: Переранжирование.

source: Query
ru: Запрос

source: The query to retrieve.
ru: Запрос для извлечения.

source: Candidates
ru: Кандидаты

source: The retrieved candidates.
ru: Извлеченные кандидаты.

source: Embedding Assembler Operator
ru: Оператор сборки эмбеддингов

source: Load knowledge and assemble embedding chunks to vector store.
ru: Загрузить знания и собрать фрагменты эмбеддингов в векторное хранилище.

source: Vector Store Connector
ru: Коннектор векторного хранилища

source: The chunk parameters.
ru: Параметры фрагмента.

source: The knowledge to be loaded.
ru: Знания, которые нужно загрузить.

source: The assembled chunks, it has been persisted to vector store.
ru: Собранные фрагменты, они были сохранены в векторном хранилище.

source: Knowledge Loader Operator
ru: Оператор загрузки знаний

source: The knowledge operator, which can create knowledge from datasource.
ru: Оператор знаний, который может создавать знания из источника данных.

source: knowledge datasource
ru: Источник данных знаний

source: knowledge datasource, which can be a document, url, or text.
ru: Источник данных знаний, который может быть документом, URL-адресом или текстом.

source: Knowledge object.
ru: Объект знаний.

source: Default datasource
ru: Стандартный источник данных

source: Default datasource.
ru: Стандартный источник данных.

source: Knowledge type
ru: Тип знаний

source: Knowledge type.
ru: Тип знаний.

source: Chunks To String Operator
ru: Оператор преобразования фрагментов в строку

source: Convert chunks to string.
ru: Преобразовать фрагменты в строку.

source: The separator between chunks.
ru: Разделитель между фрагментами.

source: The input chunks.
ru: Входные фрагменты.

source: String
ru: Строка

source: The output string.
ru: Выходная строка.

source: Knowledge Process Branch Operator
ru: Оператор ветвления процесса знаний

source: Branch the workflow based on the stream flag of the request.
ru: Ветвить рабочий процесс на основе флага потока запроса.

source: Document Chunks
ru: Фрагменты документа

source: The input value of the operator.
ru: Входное значение оператора.

source: Chunks for Vector Storage Connector.
ru: Фрагменты для подключения к векторному хранилищу.

source: Chunks for Knowledge Graph Connector.
ru: Чанки для коннектора знаний графа.

source: Chunks for Full Text Connector.
ru: Чанки для коннектора полного текста.

source: Knowledge Process Join Operator
ru: Оператор объединения процессов знаний

source: Join Branch the workflow based on the Knowledge Process Results.
ru: Объединить ветку рабочего процесса на основе результатов обработки знаний.

source: Vector Storage Results
ru: Результаты векторного хранения

source: vector storage results.
ru: результаты векторного хранения.

source: Knowledge Graph Storage Results
ru: Результаты хранения знаний графа

source: knowledge graph storage results.
ru: результаты хранения знаний графа.

source: Knowledge Process Results.
ru: Результаты обработки знаний.

source: Full Text Storage Operator
ru: Оператор хранения полного текста

source: Persist embeddings into full text storage.
ru: Сохранить эмбеддинги в хранилище полного текста.

source: Full Text Connector
ru: Коннектор полного текста

source: The full text store.
ru: Хранилище полного текста.

source: The assembled chunks, it has been persisted to full text store.
ru: Собранные чанки были сохранены в хранилище полного текста.

source: Vector Storage Operator
ru: Оператор векторного хранения

source: Persist embeddings into vector storage.
ru: Сохранить эмбеддинги в векторном хранилище.

source: The vector store.
ru: Векторное хранилище.
